{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "Feature evidence report listing implemented features, referenced files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entrypoint loading main React bundle and Playfair Display font with site metadata.",
  "frontend/src/App.tsx": "Sets up TanStack Router with layout and routes for Home, Books, and About pages.",
  "frontend/src/components/SafeImage.tsx": "Image component that swaps to a fallback source on load error.",
  "frontend/src/components/SiteFooter.tsx": "Footer displaying copyright text and a Caffeine.ai attribution link.",
  "frontend/src/components/SiteHeader.tsx": "Responsive header with navigation links and mobile menu toggle.",
  "frontend/src/content/siteContent.ts": "Centralized site content including hero text, book data, and about-page assets.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor using identity changes and React Query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Internet Identity auth provider and hook managing login state and identities.",
  "frontend/src/hooks/useQueries.ts": "Placeholder for future React Query hooks for backend interaction.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive CSS variables for light/dark themes and applies base typography and layout styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page showing an author portrait, biography text, and optional highlights from siteContent.",
  "frontend/src/pages/BooksPage.tsx": "Displays a list of books with cover images, status badges, blurbs, and optional extended descriptions.",
  "frontend/src/pages/HomePage.tsx": "Defines the homepage with a hero section and a featured books section using data from siteContent.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins, mapping CSS variables to theme values.",
  "project_state.json": "Tracks project requirements, known issues, and architectural notes for the author website build."
}