{
  "kind": "build_request",
  "title": "Fix broken image links across the author site",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-8",
      "text": "Fix broken image URLs so all images referenced by the site load correctly in production, including the hero background, the Torment cover, the coming-soon cover placeholder, and the author portrait.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "Oh wait, youve got broken links on the images"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /, /books, and /about shows no broken images (no empty image boxes).",
        "The following paths resolve to actual static files (no 404s): siteContent.hero.backgroundImage, each entry in siteContent.books[].coverImage, and siteContent.about.portraitImage.",
        "All image filenames referenced in code match the exact filenames present under frontend/public (including case sensitivity)."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a graceful image fallback for book covers and the author portrait so that if an image fails to load at runtime, the UI swaps to an existing local placeholder instead of showing a broken image icon.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-5"
        ],
        "quotes": [
          "broken links on the images"
        ]
      },
      "acceptanceCriteria": [
        "If any cover/portrait image fails to load, the UI displays a local placeholder image instead.",
        "Fallback behavior works on Home, Books, and About pages.",
        "No infinite onError loops occur when applying the fallback."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (Shadcn components are read-only).",
    "Do not modify immutable hook entrypoints listed in SYSTEM_CONTEXT."
  ],
  "nonGoals": [
    "Adding new pages or changing the site’s information architecture.",
    "Introducing backend image serving or storing images in the Motoko canister."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}